app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def show
    @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def destroy
    redirect_to root_path
    @character = Character.find(params[:id])
    @character.destroy
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 1]]