app/controllers/houses_controller.rb

UPDATE "houses" SET "name" = $1 WHERE "houses"."id" = $2  [["name", "cool lannister"], ["id", 2]]
---
  def update
    @house = House.find(params[:id])
    @house.update(house_params)

DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 1]]
---
  def destroy
    redirect_to root_path
    @house = House.find(params[:id])
    @house.destroy